# Height Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPCurve..::..Height Property
MEPCurve Class See Also
---
The height of the MEP curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Height { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Height As Double
	Get
```

Visual C++
---
```text
public:
property double Height {
	double get ();
}
```

# Remarks
This property is used to retrieve the height of the MEP curve.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the MEP curve's Shape is not rectangular. |

# See Also
MEPCurve Class
Autodesk.Revit.DB Namespace